# [ DataFrame vs SQL ]

# SELECT

In [1]:
import pandas as pd
import numpy as np

In [2]:
emp= pd.read_csv("./lec08_emp.csv",parse_dates=['HIREDATE'])
emp.head(3)

   EMPNO  ENAME       JOB     MGR   HIREDATE   SAL   COMM  DEPTNO
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

In [3]:
emp.columns=emp.columns.str.lower() 
#컬럼명 소문자로 바꾸기
#반드시 다시 emp.columns에 다시 넣어주어야 함

In [4]:
emp.head(3)

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

## 1. SELECT ... FROM

- <font size = 4, color="red"><b> df[ </font></b> 컬럼 <font size = 4, color="red"><b> ]</font></b>
- <font size = 4, color="red"><b> df[ [</font></b> 컬럼1 , 컬럼2 <font size = 4, color="red"><b>] ]</font></b>

- select * from emp;

In [5]:
emp.head(3)

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

- select ename from emp;

In [6]:
emp['ename'].head()

0     SMITH
1     ALLEN
2      WARD
3     JONES
4    MARTIN
Name: ename, dtype: object

- select ename, empno from emp;

In [7]:
emp[['ename','empno']].head()

    ename  empno
0   SMITH   7369
1   ALLEN   7499
2    WARD   7521
3   JONES   7566
4  MARTIN   7654

## 2. loc / iloc

- loc[줄,칸] : 값으로 꺼내기
- iloc[줄,칸] : 인덱스로 꺼내기
- [줄,칸]
     - 단일값
     - 리스트: [단일값, 단일값, 단일값]
     - 슬라이싱[ : ]

- 2개 혼용 불가

### 2.1 lioc [줄, 칸]

#### 2.1.1 단일값 / [단일값, 단일값]

In [8]:
emp.iloc[0] #한줄일때 retrn type은 Series

empno                      7369
ename                     SMITH
job                       CLERK
mgr                      7902.0
hiredate    1980-12-17 00:00:00
sal                         800
comm                        NaN
deptno                       20
Name: 0, dtype: object

In [9]:
emp.iloc[[0,1]] #여러 줄 일때 retrn type은 dataframe

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30

In [10]:
emp.iloc[[0,3,5]] # 줄 : [단일값, 단일값, 단일값]

   empno  ename      job     mgr   hiredate   sal  comm  deptno
0   7369  SMITH    CLERK  7902.0 1980-12-17   800   NaN      20
3   7566  JONES  MANAGER  7839.0 1981-04-02  2975   NaN      20
5   7698  BLAKE  MANAGER  7839.0 1981-05-01  2850   NaN      30

In [11]:
emp.iloc[0 , 0] # 줄 : 단일값, 칸 : 단일값

7369

In [12]:
emp.iloc[0 , [0,1]] # 줄 : 단일값, 칸 :[단일값, 단일값]

empno     7369
ename    SMITH
Name: 0, dtype: object

In [13]:
emp.iloc[[0,1,2] , [0,1]] # 줄 :[단일값, 단일값, 단일값] 단일값, 칸 :[단일값, 단일값]

   empno  ename
0   7369  SMITH
1   7499  ALLEN
2   7521   WARD

#### 2.1.2 슬라이싱

In [14]:
emp.iloc[0:3] # 줄 : 슬라이싱

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

In [15]:
emp.iloc[0:3,1:4] #줄 :슬라이싱, 칸 : 슬라이싱

   ename       job     mgr
0  SMITH     CLERK  7902.0
1  ALLEN  SALESMAN  7698.0
2   WARD  SALESMAN  7698.0

In [16]:
emp.iloc[[0,2,5],1:4] # 줄 : [단일값, 단일값, 단일값], 칸 : 슬라이싱

   ename       job     mgr
0  SMITH     CLERK  7902.0
2   WARD  SALESMAN  7698.0
5  BLAKE   MANAGER  7839.0

### 2.2 loc [줄값, 칸값]
- 줄값 : index 값

#### 2.2.1 단일값 / [단일값, 단일값]

In [17]:
emp.loc[[1,2,3], 'empno']

1    7499
2    7521
3    7566
Name: empno, dtype: int64

In [18]:
emp.loc[[1,2,3], ['empno','ename']]

   empno  ename
1   7499  ALLEN
2   7521   WARD
3   7566  JONES

#### 2.2.2 슬라이싱

<font color = "red"><b> loc으로 슬라이싱 시 미만이 아니다 ******* <br>
    'empno' : 'mgr' 이라고 하면 mgr도 포함된다

In [19]:
emp.loc[0:3, 'empno' : 'job']  #줄 값: 0,1,2,3(index 주소 아님)

   empno  ename       job
0   7369  SMITH     CLERK
1   7499  ALLEN  SALESMAN
2   7521   WARD  SALESMAN
3   7566  JONES   MANAGER

- 문제

In [20]:
emp.iloc[1:5,2:5]

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

## 3.WHERE 조건
- <font size = 4, color="red"><b> df[ </font></b> 컬럼 <font size = 4, color="red"><b> ]</font></b>
- <font size = 4, color="red"><b> df[ </font></b> 조건 <font size = 4, color="red"><b> ]</font></b>
- <font size = 4, color="red"><b> df[ </font></b> 조건 <font size = 4, color="red"><b>][ </font></b> 컬럼 <font size = 4, color="red"><b>]</font></b>
- <font size = 4, color="red"><b> df[ </font></b> 컬럼 <font size = 4, color="red"><b>][ </font></b> 조건 <font size = 4, color="red"><b>]</font></b>

### 3.1 단일 조건

- select * from emp where deptno=10;

In [21]:
emp[emp['deptno']==10]

    empno   ename        job     mgr   hiredate   sal  comm  deptno
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450   NaN      10
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000   NaN      10
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300   NaN      10

- select empno, ename from emp where deptno=10;

In [22]:
emp[['empno','ename']][emp['deptno']==10] #조건과 컬럼 순서바뀌어도 무관

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

### 3.2 멀티 조건
- <font size = 4, color="red"><b>df [ 컬럼 ][ (조건) & (조건) | (조건) ]
- and : &
- or  : |
- 조건은 반드시 괄호로 묶어라

- select empno, ename from emp where deptno=10 and sal>2000;

In [23]:
emp[['empno','ename','sal']][(emp['deptno']==10)&(emp['sal']>2000)]

   empno ename   sal
6   7782   CCC  2450
8   7839  KING  5000

### 3.3 서브쿼리 ----------> 비추

<pre>
<문제1> 사번이 7369인 사원의 직업과 같은 사원들의 이름, 직업 출력
select ename, job 
from emp 
where job=(select job from emp where empno=7369);

In [24]:
#select job from emp where empno=7369
job7369= emp['job'] [emp['empno']==7369].values[0]
job7369

'CLERK'

In [25]:
#select ename, job from emp where job='CLERK'
emp[['ename','job']][emp['job']=='CLERK']

     ename    job
0    SMITH  CLERK
10   ADAMS  CLERK
11   JAMES  CLERK
13  MILLER  CLERK

In [26]:
emp[['ename','job']][emp['job']==job7369]

     ename    job
0    SMITH  CLERK
10   ADAMS  CLERK
11   JAMES  CLERK
13  MILLER  CLERK

<pre>
<문제2> 10번부서 사람들의 직업과 같은 사원의 사원들의 이름, 직업 출력
select ename, job 
from emp 
where job in (select job from emp where deptno=10);

In [27]:
#select job from emp where deptno=10
job10_arr=emp['job'][emp['deptno']==10].values
job10_arr

array(['MANAGER', 'PRESIDENT', 'CLERK'], dtype=object)

In [28]:
#select ename, job from emp where job in ('MANAGER','PRESIDENT','CLERK')
emp[['ename','job']][emp['job'].isin (['MANAGER','PRESIDENT','CLERK'])].head()

   ename        job
0  SMITH      CLERK
3  JONES    MANAGER
5  BLAKE    MANAGER
6    CCC    MANAGER
8   KING  PRESIDENT

In [29]:
emp[['ename','job']][emp['job'].isin(job10_arr)].head()

   ename        job
0  SMITH      CLERK
3  JONES    MANAGER
5  BLAKE    MANAGER
6    CCC    MANAGER
8   KING  PRESIDENT

## 4. 컬럼 연산
- select job || ename from emp;
- select concat(job ,ename) from emp;

In [30]:
emp['job']+emp['ename']
#타입이 다르면 안된다.

0         CLERKSMITH
1      SALESMANALLEN
2       SALESMANWARD
3       MANAGERJONES
4     SALESMANMARTIN
5       MANAGERBLAKE
6         MANAGERCCC
7       ANALYSTSCOTT
8      PRESIDENTKING
9     SALESMANTURNER
10        CLERKADAMS
11        CLERKJAMES
12       ANALYSTFORD
13       CLERKMILLER
dtype: object

- select sal,sal*12 as asal from emp;

In [31]:
emp['asal']=emp['sal']*12
#컬럼 추가하며 해당 값을 넣음
#기존 컬럼에 해당 값을 넣으면 원본 값을 덮음

In [32]:
emp.head()

   empno   ename       job     mgr   hiredate   sal    comm  deptno   asal
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20   9600
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30  19200
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30  15000
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20  35700
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30  15000

## 5. 결측 처리
- df.dropna()
- df.fillna() ---------- nvl(comm,0)
- df.isna()   ---------- where comm is null

- select comm, nvl(comm,0) as comm2 from emp;

In [33]:
emp['comm2']=emp['comm'].fillna(0)
emp.head()

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2
0,7369,SMITH,CLERK,7902.0,1980-12-17,800,NaN,20,9600,0.0
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,300.0,30,19200,300.0
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,500.0,30,15000,500.0
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,NaN,20,35700,0.0
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250,1400.0,30,15000,1400.0

## 6. 그룹(GROUP BY)
- 그룹 함수 : mean(), max(), min(), count(), sum(), std(), var()....

### 6.1 1개의 컬럼에 1개의 그룹 함수 사용
- <font size = 4, color="red"><b>df . groupby (</font></b>"그룹할 컬럼명"<font size = 4, color="red"><b>)</font></b> [결과 보고싶은 컬럼명]<font size = 4, color="red"><b> . 그룹함수()</font></b>
- <font size = 4, color="red"><b>df . groupby (</font></b>"그룹할 컬럼명"<font size = 4, color="red"><b>) . agg({"컬럼명":"그룹함수","key":"컬럼명"})</font></b>

<pre>
<문제1> 각 부서별 사원 수 출력
select deptno,count(empno) from emp group by deptno;

In [34]:
emp.groupby("deptno").first() #첫번째 그룹 확인

        empno  ename       job     mgr   hiredate   sal   comm   asal  comm2
deptno
10       7782    CCC   MANAGER  7839.0 1981-06-09  2450    NaN  29400    0.0
20       7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN   9600    0.0
30       7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0  19200  300.0

In [35]:
emp.groupby("deptno")['deptno'].count()

deptno
10    3
20    5
30    6
Name: deptno, dtype: int64

<pre>
<문제2> 각 부서별 급여 합
select deptno,sum(sal) from emp group by deptno;

In [36]:
emp.groupby("deptno")['sal'].sum()

deptno
10     8750
20    10875
30     9400
Name: sal, dtype: int64

In [38]:
emp.groupby("deptno").agg( {"sal":"max","comm":"min"}) #agg({}):합쳐라

         sal  comm
deptno
10      5000   NaN
20      3000   NaN
30      2850   0.0

### 6.2 동일 컬럼에 두개 이상의 그룹함수 사용
- <font size = 4, color="red"><b>df . groupby (</font></b>"그룹할 컬럼명"<font size = 4, color="red"><b>) [</font></b>결과 보고싶은 컬럼명<font size = 4, color="red"><b>] . agg([그룹함수1, 그룹함수2])</font></b>

<pre>
<문제1> 부서별 최대 최소 급여
select deptno,max(sal),min(sal) from emp group by deptno;

In [37]:
emp.groupby("deptno")['sal'].max()
emp.groupby("deptno")['sal'].min()

deptno
10    1300
20     800
30     950
Name: sal, dtype: int64

In [39]:
#emp.groupby("deptno").agg( {"sal":"max","sal":"min"}) --> dict 안의 sal 키가 중복되어 error

# 컬럼을 밖으로 빼고 .agg( [ 그룹함수, 그룹함수] )
emp.groupby("deptno")['sal'].agg( ['max','min'])

         max   min
deptno
10      5000  1300
20      3000   800
30      2850   950

<pre>
<문제2> 각 부서별 급여의 합, 최대 , 최소, 평균
select deptno,max(sal),min(sal),avg(sal) from emp group by deptno;

In [40]:
emp.groupby("deptno")["sal"].agg(["sum","max","min","mean","count","std","var"])
#python 버전에 따라 agg() 함수에 count 사용 가능 여부 다름

          sum   max   min         mean  count          std           var
deptno
10       8750  5000  1300  2916.666667      3  1893.629672  3.585833e+06
20      10875  3000   800  2175.000000      5  1123.332097  1.261875e+06
30       9400  2850   950  1566.666667      6   668.331255  4.466667e+05

## 7. 정렬(sort)
1. sort_index()
2. sort_values()
- <font color='red'><b>df에서 꺼내진 컬럼에 대해서만 정렬이 가능</font></b>
    - emp[['empno', 'ename', 'sal']].sort_values(by="ename",ascending=True)  -->가능
    - emp[['empno', 'ename', 'sal']].sort_values(by="job",ascending=True)    -->불가능

### 7.1 sort_values()

- select sal from emp order by sal asc;

In [41]:
emp['sal'].sort_values(ascending=True).head()

0      800
11     950
10    1100
2     1250
4     1250
Name: sal, dtype: int64

- select sal from emp order by sal desc;

In [42]:
emp['sal'].sort_values(ascending=False).head()

8     5000
7     3000
12    3000
3     2975
5     2850
Name: sal, dtype: int64

- select empno, ename, sal from emp where deptno=20 order by ename asc;

In [43]:
emp[['empno', 'ename', 'sal']][emp['deptno']==20].sort_values(by="ename",ascending=True) #default asc, 'by=' 안써도 됨

    empno  ename   sal
10   7876  ADAMS  1100
12   7902   FORD  3000
3    7566  JONES  2975
7    7788  SCOTT  3000
0    7369  SMITH   800

- select empno, ename, sal from emp order by deptno asc, sal asc;

In [44]:
#둘다 asc 인 경우
emp[['empno', 'deptno', 'sal']].sort_values(by=["deptno","sal"],ascending=True).head()

    empno  deptno   sal
13   7934      10  1300
6    7782      10  2450
8    7839      10  5000
0    7369      20   800
10   7876      20  1100

- select empno, ename, sal from emp order by deptno asc, sal desc;

In [45]:
#하나는 asc, 다른 하나는 desc인 경우
emp[['empno', 'deptno', 'sal']].sort_values(by=["deptno","sal"],ascending=[True,False]).head()

    empno  deptno   sal
8    7839      10  5000
6    7782      10  2450
13   7934      10  1300
7    7788      20  3000
12   7902      20  3000

### 7.2 sort_index()

In [78]:
emp.sort_index(ascending=False).head()

,empno,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str,job2,job3
13,7934,CLERK,7782.0,1982-01-23,1300,9999,10,15600,0.0,십,SALES10,SALES101010
12,7902,ANALYST,7566.0,1981-12-03,3000,9999,20,36000,0.0,그외,ANALYST,ANALYST
11,7900,CLERK,7698.0,1981-12-03,950,9999,30,11400,0.0,그외,CLERK,CLERK
10,7876,CLERK,7788.0,1987-07-13,1100,9999,20,13200,0.0,그외,CLERK,CLERK
9,7844,SALESMAN,7698.0,1981-09-08,1500,9999,30,18000,0.0,그외,SALESMAN,SALESMAN

# UPDATE
- df[기존컬럼] = 값  -->수정
- df[신규컬럼] = 값  -->신규 컬럼 생성

## 1. 기존 컬럼 수정

In [46]:
emp['comm']=9999
emp.head(3)
#rollback 없음

   empno  ename       job     mgr   hiredate   sal  comm  deptno   asal  comm2
0   7369  SMITH     CLERK  7902.0 1980-12-17   800  9999      20   9600    0.0
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  9999      30  19200  300.0
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  9999      30  15000  500.0

## 2. at / iat
1) 단일 값 변경만 가능
- <font color="red"><b>df . at [ 줄값, 칸값 ] = 변경값
- <font color="red"><b>df . iat [ 줄idx, 칸idx ] = 변경값
    
2) 여러개 값 변경    
- <font color="red"><b>df . loc [ 줄값, 칸값 ] = 변경값
- <font color="red"><b>df . iloc [ 줄idx, 칸idx ] = 변경값

In [47]:
#update emp set ename='SSSMITHSS' where _____
emp.at[0,"ename"]="SSSMITHSS"
emp.head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2
0,7369,SSSMITHSS,CLERK,7902.0,1980-12-17,800,9999,20,9600,0.0
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0

In [52]:
emp.iat[0,1]='kkk'
#emp.iat[0:2,1]='ooo' #여러개의 값 변경 불가
emp.head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str,job2
0,7369,kkk,CLERK,7902.0,1980-12-17,800,9999,20,9600,0.0,그외,CLERK
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0,그외,SALESMAN
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0,그외,SALESMAN

In [53]:
emp.iloc[0:2,1] = 'ooo' 
emp.head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str,job2
0,7369,ooo,CLERK,7902.0,1980-12-17,800,9999,20,9600,0.0,그외,CLERK
1,7499,ooo,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0,그외,SALESMAN
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0,그외,SALESMAN

## 3. np.where() vs pd.where()
1. np.where(조건절, 참값, 거짓값)  
    - np.where(df['deptno']==10, '십', '그외') --> decode(deptno,10,'십','그외')
     <br>
      <br>
2. df[컬럼A].where(조건문, 거짓값)  --조건 만족하면 컬럼A, 그렇지 않으면 거짓값

In [48]:
emp['deptno_str']=np.where(emp['deptno']==10, '십', '그외')
emp.head(7)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str
0,7369,SSSMITHSS,CLERK,7902.0,1980-12-17,800,9999,20,9600,0.0,그외
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0,그외
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0,그외
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,9999,20,35700,0.0,그외
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250,9999,30,15000,1400.0,그외
5,7698,BLAKE,MANAGER,7839.0,1981-05-01,2850,9999,30,34200,0.0,그외
6,7782,CCC,MANAGER,7839.0,1981-06-09,2450,9999,10,29400,0.0,십

- update emp set job='SALES10' where deptno=10;

In [51]:
#-------------------------------------------
#emp[emp['deptno']==10]['job'] ="SALES10" 
#emp['job'][emp['deptno']==10] ="SALES10" XXXXXXXXXXXXX -->불안정한 문법
#-------------------------------------------
emp['job2']=np.where(emp['deptno']==10, "SALES10", emp['job'])
emp[['job','job2']].head(8)

        job      job2
0     CLERK     CLERK
1  SALESMAN  SALESMAN
2  SALESMAN  SALESMAN
3   MANAGER   MANAGER
4  SALESMAN  SALESMAN
5   MANAGER   MANAGER
6   MANAGER   SALES10
7   ANALYST   ANALYST

아래 두 코드는 동일 결과

In [59]:
#df[컬럼A].where(조건문, 거짓값) 
emp['job2']=np.where(emp['deptno']==10, "SALES10", emp['job'])

#조건을 만족하면(이거출력).where(조건, 조건을 만족하지못하면(이거출력) )
emp['job3']=emp['job'].where(emp['deptno']!=10, "SALES101010")
emp[['job','job2','job3']].head(8)

        job      job2         job3
0     CLERK     CLERK        CLERK
1  SALESMAN  SALESMAN     SALESMAN
2  SALESMAN  SALESMAN     SALESMAN
3   MANAGER   MANAGER      MANAGER
4  SALESMAN  SALESMAN     SALESMAN
5   MANAGER   MANAGER      MANAGER
6   MANAGER   SALES10  SALES101010
7   ANALYST   ANALYST      ANALYST

# DELETE
- DML : Delete from emp;      --데이터 삭제
- DDL : Drop table from emp;  --테이블객체 삭제
<br>
<br>
- drop(<font color='red'><b>인덱스값, axis=0</font></b>)  --데이터 행(가로) 삭제
- drop(<font color='red'><b>컬럼명, axis=1</font></b>)  --데이터 컬럼(세로) 삭제
- del emp                     --데이터프레임 객체 삭제

In [61]:
emp=emp.drop(0)  #여러번 실행할 경우 인덱스 0 이없기때문에 error

In [69]:
emp.head()

,empno,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str,job2,job3
2,7521,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0,그외,SALESMAN,SALESMAN
3,7566,MANAGER,7839.0,1981-04-02,2975,9999,20,35700,0.0,그외,MANAGER,MANAGER
4,7654,SALESMAN,7698.0,1981-09-28,1250,9999,30,15000,1400.0,그외,SALESMAN,SALESMAN
5,7698,MANAGER,7839.0,1981-05-01,2850,9999,30,34200,0.0,그외,MANAGER,MANAGER
6,7782,MANAGER,7839.0,1981-06-09,2450,9999,10,29400,0.0,십,SALES10,SALES101010

In [70]:
emp= emp.drop(2,axis=0) #인덱스값이 2인 행 삭제
emp.head(3)

,empno,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str,job2,job3
3,7566,MANAGER,7839.0,1981-04-02,2975,9999,20,35700,0.0,그외,MANAGER,MANAGER
4,7654,SALESMAN,7698.0,1981-09-28,1250,9999,30,15000,1400.0,그외,SALESMAN,SALESMAN
5,7698,MANAGER,7839.0,1981-05-01,2850,9999,30,34200,0.0,그외,MANAGER,MANAGER

In [67]:
emp=emp.drop("ename",axis=1) #ename인 컬럼 삭제
emp.head(3)

,empno,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str,job2,job3
2,7521,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0,그외,SALESMAN,SALESMAN
3,7566,MANAGER,7839.0,1981-04-02,2975,9999,20,35700,0.0,그외,MANAGER,MANAGER
4,7654,SALESMAN,7698.0,1981-09-28,1250,9999,30,15000,1400.0,그외,SALESMAN,SALESMAN

In [76]:
#보통 삭제가 아닌 필요한 컬럼만을 복사하여 다른 테이블로 만듬
print(emp.columns.values.tolist())
empcp=emp[['empno', 'job', 'mgr', 'hiredate', 'deptno_str' ]]
emp.head(3)

['empno', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno', 'asal', 'comm2', 'deptno_str', 'job2', 'job3']

,empno,job,mgr,hiredate,sal,comm,deptno,asal,comm2,deptno_str,job2,job3
3,7566,MANAGER,7839.0,1981-04-02,2975,9999,20,35700,0.0,그외,MANAGER,MANAGER
4,7654,SALESMAN,7698.0,1981-09-28,1250,9999,30,15000,1400.0,그외,SALESMAN,SALESMAN
5,7698,MANAGER,7839.0,1981-05-01,2850,9999,30,34200,0.0,그외,MANAGER,MANAGER

In [74]:
del empcp  #drop table과 유사 --> 메모리에서 삭제 pd.read_csv() 다시 읽어들여야 함

In [75]:
#NameError: name 'empcp' is not defined 
#empcp  -->메모리에서 삭제되어 사용 불가

NameError: name 'empcp' is not defined